//Уроки 35-37. Введение в тестирование

/**
 * Сопоставление полученного результата с ожидаемым называется - assert
 * Если тест завален формируется специальное исключение AssertionError
 *
 * TDD - Test Driven Development - разработка через тестирование (одна из парадигм разработки)
 *
 * Крутой разработчик:
 * 1) Сначала разработчик создает конкретные цели для будущей программы
 * 2) Далее он пишет тесты исходя из целей на программу
 * 3) Далее пишет программу, которая эти тесты проходит
 *
 *
 */

public class Test1 {
    public static void main(String[] args) {
    }
}
